Catalogs/упДополнительноеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упДополнительноеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяУчетГСМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяРазличныеРежимыРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДополнительногоОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыДополнительногоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоточасыОтсчетаТО</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегОтсчетаТО</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пробег</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтсчетаТО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьНормыРасходаГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упНормыРасходаГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстановки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/упСостоянияОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСостоянияОборудования</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСостоянияОборудования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/упКорректировкаОстатковГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упКорректировкаОстатковГСМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упОстаткиГСМ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/упДополнительноеОборудование/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();		
	КонецЕсли; 
	СостояниеОборудования = РегистрыСведений.упСостоянияОборудования.ПолучитьСостояние(ТекущийОбъект.Ссылка);
	Элементы.СостояниеОборудывания.Видимость = ЗначениеЗаполнено(СостояниеОборудования);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	ЗаполнитьНормыГСМ();	
	ЗаблокироватьЭлементы();
	
	НастроитьПанельНавигации();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НастроитьПанельНавигации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "КорректировкаОстатковГСМ" Тогда
		Если Параметр = Объект.Ссылка Тогда
			ЗаполнитьНормыГСМ();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидыГСМПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Если Объект.ВидыГСМ.Количество() = 1 Тогда
			Элемент.ТекущиеДанные.Основной = Истина;
		КонецЕсли
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыГСМПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если НЕ ОтменаРедактирования Тогда
		
		ВидГСМ = ТекущиеДанные.ВидГСМ;
		мсвСтроки = Объект.ВидыГСМ.НайтиСтроки(Новый Структура("ВидГСМ",ВидГСМ));
		
		Если мсвСтроки.Количество() > 1 Тогда
			ТекстСообщения = Нстр("ru = 'Уже есть строка с видом ГСМ:%1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ВидГСМ); 
			ИндексСтроки = ТекущиеДанные.НомерСтроки - 1;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Объект.Ссылка,"Объект.ВидыГСМ[" + Формат(ИндексСтроки,"ЧН=0; ЧГ=0") + "].ВидГСМ");							
		КонецЕсли;
	Иначе
		Если ТекущиеДанные.Основной Тогда
			Если Объект.ВидыГСМ.Количество() > 1 Тогда
				Объект.ВидыГСМ[0].Основной = Истина;
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидыГСМПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекущиеДанные 	= Элементы.ВидыГСМ.ТекущиеДанные;
	ТекущиеДанные.Изменить = "Изменить";
	сткОстаткиГСМ = УровеньТоплива(ЭтотОбъект.Объект.Ссылка, ТекущиеДанные.ВидГСМ);
	ТекущиеДанные.КоличествоОстаток = сткОстаткиГСМ.Количество;
	ТекущиеДанные.СтоимостьОстаток = сткОстаткиГСМ.Стоимость;
КонецПроцедуры

&НаКлиенте
Процедура ВидыГСМВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ВидыГСМИзменить" Тогда
		ТекущиеДанные = Элементы.ВидыГСМ.ТекущиеДанные;
		ТранспортноеСредство 	= Объект.Ссылка;
		ВидГСМ 				= ТекущиеДанные.ВидГСМ;
		сткПараметры = Новый Структура("ТранспортноеСредство, ВидГСМ", ТранспортноеСредство, ВидГСМ);
		ОткрытьФорму("Документ.упКорректировкаОстатковГСМ.Форма.ФормаДокумента", сткПараметры);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидыГСМПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ВидыГСМ.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Если ТекущиеДанные.Основной = Истина Тогда
			Для каждого СтрокаНорма Из Объект.ВидыГСМ Цикл
				СтрокаНорма.Основной = Ложь;
			КонецЦикла;
			ТекущиеДанные.Основной  = Истина;
		Иначе
			ТекущиеДанные.Основной  = Ложь;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидыГСМОсновнойПриИзменении(Элемент)
	ТекущиеДанные 	= Элементы.ВидыГСМ.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		мсвСтроки = Объект.ВидыГСМ.НайтиСтроки(Новый Структура("Основной",Истина));
		Если мсвСтроки.Количество() = 0 Тогда
			ТекущиеДанные.Основной = Истина;	
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяУчетГСМПриИзменении(Элемент)
	ЗаблокироватьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	упСервисныеФункцииКлиентСервер.УстановитьКартинкуКомментария(Элементы.ГруппаКомментарий, Объект.Комментарий);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗаполнитьНормыГСМ()
	
	тбзОстатки = упПутевойЛистУчетГСМ.УровеньТопливаПоРегиструОстатковПоТС(Объект.Ссылка);
	
	Для каждого Строка Из Объект.ВидыГСМ Цикл
		Строка.Изменить = "Изменить";
		мсвСтроки = тбзОстатки.НайтиСтроки(Новый Структура("ВидГСМ",Строка.ВидГСМ));
		Если мсвСтроки.Количество() > 0 Тогда
			Строка.КоличествоОстаток	= мсвСтроки[0].КоличествоОстаток;
			Строка.СтоимостьОстаток	= мсвСтроки[0].СтоимостьОстаток;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УровеньТоплива(ТранспортноеСредство, ВидГСМ)
	сткОстаткиГСМ	= упПутевойЛистУчетГСМ.УровеньТопливаПоРегиструОстатков(ТранспортноеСредство, ВидГСМ);
	Возврат сткОстаткиГСМ;
КонецФункции

&НаСервере
Процедура ЗаблокироватьЭлементы()
	Элементы.ВидыГСМ.ТолькоПросмотр = НЕ Объект.ИспользуетсяУчетГСМ;
КонецПроцедуры

&НаСервере
Процедура НастроитьПанельНавигации()

	сткНастроек = Новый Структура;
	сткНастроек.Вставить("ИспользоватьДанныеРазличныхРежимовРаботы", Объект.ИспользуютсяРазличныеРежимыРаботы);
	упСервисныеФункции.НастроитьФормуПоПараметрам(ЭтаФорма, сткНастроек);

КонецПроцедуры

#КонецОбласти
